ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5x/serial_api.c
/***
 *       _____ _       _           _  __      __        _       _     _           
 *      / ____| |     | |         | | \ \    / /       (_)     | |   | |          
 *     | |  __| | ___ | |__   __ _| |  \ \  / /_ _ _ __ _  __ _| |__ | | ___  ___ 
 *     | | |_ | |/ _ \| '_ \ / _` | |   \ \/ / _` | '__| |/ _` | '_ \| |/ _ \/ __|
 *     | |__| | | (_) | |_) | (_| | |    \  / (_| | |  | | (_| | |_) | |  __/\__ \
 *      \_____|_|\___/|_.__/ \__,_|_|     \/ \__,_|_|  |_|\__,_|_.__/|_|\___||___/
 *                                                                                
 *                                                                                
 */

/**
 * UARTE state. One for each instance.
 */
static nordic_uart_state_t nordic_nrf5_uart_state[UART_ENABLED_COUNT] = { 0 };

/**
 * Array with UARTE register pointers for easy access.
 */
static NRF_UARTE_Type *nordic_nrf5_uart_register[UART_ENABLED_COUNT] = {
    NRF_UARTE0,
#if UART1_ENABLED
    NRF_UARTE1,
#endif
};

/**
 * @brief      Create atomic fifo using macro. Macro defines static arrays 
 *             for buffer and internal state.
 */
NRF_ATFIFO_DEF(nordic_nrf5_uart_fifo_0, uint8_t, UART0_FIFO_BUFFER_SIZE);

#if UART1_ENABLED
NRF_ATFIFO_DEF(nordic_nrf5_uart_fifo_1, uint8_t, UART1_FIFO_BUFFER_SIZE);
#endif

/**
 * Global variables expected by mbed_retarget.cpp for STDOUT.
 */
int stdio_uart_inited = 0;
serial_t stdio_uart = { 0 };


/***
 *       _____          _                    _______ _                     
 *      / ____|        | |                  |__   __(_)                    
 *     | |    _   _ ___| |_ ___  _ __ ___      | |   _ _ __ ___   ___ _ __ 
 *     | |   | | | / __| __/ _ \| '_ ` _ \     | |  | | '_ ` _ \ / _ \ '__|
 *     | |___| |_| \__ \ || (_) | | | | | |    | |  | | | | | | |  __/ |   
 *      \_____\__,_|___/\__\___/|_| |_| |_|    |_|  |_|_| |_| |_|\___|_|   
 *                                                                         
 *                                                                         
 */

/**
 * @brief      Set timout for a particular channel in RTC2.
 *
 * @param[in]  timeout  The timeout
 * @param[in]  channel  The channel
 */
static void nordic_custom_ticker_set(uint32_t timeout, int channel)
{
    /**
     * Add timeout to current time and set as compare value for channel.
     */
    uint32_t now = nrf_rtc_counter_get(NRF_RTC2);
    uint32_t ticksout = (timeout * RTC_FREQUENCY) / (1000 * 1000);
    nrf_rtc_cc_set(NRF_RTC2, channel, ticksout + now);

    /**
     * Enable interrupt for channel.
     */
    uint32_t mask = nrf_rtc_int_get(NRF_RTC2);
    nrf_rtc_int_enable(NRF_RTC2, mask | RTC_CHANNEL_INT_MASK(channel));
}

/**
 * @brief      Set idle timeout for particular instance. 
 *             This function translates instance number to RTC channel.
 *
 * @param[in]  instance  The instance
 */
static void nordic_custom_ticker_set_timeout(int instance)
{
    if (instance == 0) {

        nordic_custom_ticker_set(IDLE_TIMEOUT_US, UARTE0_RTC_TIMEOUT_CHANNEL);
    }
    else if (instance == 1) {

        nordic_custom_ticker_set(IDLE_TIMEOUT_US, UARTE1_RTC_TIMEOUT_CHANNEL);
    }
}

/**
 * @brief      Schedule callback for particular instance.
 *             This function translates instance number to RTC channel.
 *
 * @param[in]  instance  The instance
 */
static void nordic_custom_ticker_set_callback(int instance)
{
    if (instance == 0) {

        nordic_custom_ticker_set(CALLBACK_DELAY_US, UARTE0_RTC_CALLBACK_CHANNEL);
    }
    else if (instance == 1) {

        nordic_custom_ticker_set(CALLBACK_DELAY_US, UARTE1_RTC_CALLBACK_CHANNEL);
    }
}


/***
 *      _______ _                       _    _                 _ _           
 *     |__   __(_)                     | |  | |               | | |          
 *        | |   _ _ __ ___   ___ _ __  | |__| | __ _ _ __   __| | | ___ _ __ 
 *        | |  | | '_ ` _ \ / _ \ '__| |  __  |/ _` | '_ \ / _` | |/ _ \ '__|
 *        | |  | | | | | | |  __/ |    | |  | | (_| | | | | (_| | |  __/ |   
 *        |_|  |_|_| |_| |_|\___|_|    |_|  |_|\__,_|_| |_|\__,_|_|\___|_|   
 *                                                                           
 *                                                                           
 */

/**
 * @brief      Interrupt handler for idle timeouts.
 *             This function fans out interrupts from ISR and 
 *             translates channel to instance.
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_timeout_handler(uint32_t instance)
{
    /**
     * Check if any characters have been received or buffers been flushed 
     * since the last idle timeout.
     */
    if ((nordic_nrf5_uart_state[instance].rxdrdy_counter > 0) || 
        (nordic_nrf5_uart_state[instance].endrx_counter > 0)) {

        /* Activity detected, reset timeout. */
        nordic_custom_ticker_set_timeout(instance);

    } else {

        /* No activity detected, no timeout set. */
        nordic_nrf5_uart_state[instance].ticker_is_running = false;

        /** 
         * Stop Rx, this triggers a buffer swap and copies data from 
         * DMA buffer to FIFO buffer.
         */
        nrf_uarte_task_trigger(nordic_nrf5_uart_register[instance],
                               NRF_UARTE_TASK_STOPRX);
    }

    /* reset activity counters. */
    nordic_nrf5_uart_state[instance].rxdrdy_counter = 0;
    nordic_nrf5_uart_state[instance].endrx_counter = 0;
}

/**
 * @brief      Interrupt handler for scheduled callbacks.
 *             This function fans out interrupts from ISR and
 *             translates channel to instance.
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_callback_handler(uint32_t instance)
{
    /* Flag that no callback is posted. */
    nordic_nrf5_uart_state[instance].callback_posted = false;

    /* Check if callback handler is set and if event mask match. */
    uart_irq_handler callback = (uart_irq_handler) nordic_nrf5_uart_state[instance].owner->handler;
    uint32_t mask = nordic_nrf5_uart_state[instance].owner->mask;

    if (callback && (mask & NORDIC_RX_IRQ)) {

        /* Invoke callback function. */
        uint32_t context = nordic_nrf5_uart_state[instance].owner->context;
        callback(context, RxIrq);
    }
}

/**
 * @brief      RTC2 ISR. Used for timeouts and scheduled callbacks.
 */
static void nordic_nrf5_rtc2_handler(void)
{
    /* Channel 0 */
    if (nrf_rtc_event_pending(NRF_RTC2, NRF_RTC_EVENT_COMPARE_0)) {

